#+TITLE: What Are Computers, Really?
#+AUTHOR: Clarissa Littler
#+EMAIL: clarissa.littler@gmail.com
#+DATE: 6-23-2015
#+OPTIONS: H:2
#+BEAMER_THEME: Madrid
#+LATEX_CLASS: beamer

#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]

#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

*** 							      :B_block:BMCOL:
    :PROPERTIES:
    :BEAMER_env: block
    :BEAMER_col: 0.5
    :END:
   #+BEGIN_SRC haskell :exports code :results value
     let f x = sum [1..x] in f 10
   #+END_SRC

   #+RESULTS:
   : 55

